//
//  HerbData.swift
//  神农本草经
//
//  Created by Yuxiang Tang on 10/8/15.
//  Copyright (c) 2015 Yuxiang Tang. All rights reserved.
//

import Foundation

let herbData = ["丹沙":"味甘、微寒。主身体五藏百病，养精神，安魂魄，益气，明目，杀精魅邪恶鬼。久服，通神明不老。能化为汞，生山谷。",
    "云母":"味甘平。主身皮死肌，中风寒热，如在车船上，除邪气，安五脏，益子精，明目，久服轻身延年。一名云珠，一名云华，一名云英，一名云液，一名云沙，一名磷石，生山谷。",
    "玉泉":"味甘平。主五藏百病，柔筋强骨，安魂魄，长肌肉，益气，久服耐寒暑（《御览》引耐字多作能，古通），不饥渴，不老神仙。人临死服五斤，死三年色不变。一名玉札（《御览》引作玉浓，初学记引云，玉桃，服之长生不死，《御览》又引云，玉桃，服之长生不死，若不得早服之，临死日服之，其尸毕天地不朽，则朼疑当作桃），生山谷。",
    "石钟乳":"味甘温。主咳逆上气，明目益精，安五藏，通百节，利九窍，下乳汁（《御览》引云，一名留公乳，《大观本》，作一名公乳，黑字）。生山谷。",
    "涅石":"味酸寒。主寒热泄利，白沃阴蚀，恶创，目痛，坚筋骨齿。炼饵服之，轻身不老，增年。一名羽涅，生山谷。",
    "消石":"味苦寒。主五藏积热，胃张闭，涤去蓄结饮食，推陈致新，除邪气。炼之如膏，久服轻身（《御览》引云一名芒硝，《大观本》作黑字）。生山谷。",
    "朴消":"味苦寒。主百病，除寒热邪气，逐六府积聚，结固，留癖，能化七十二种石。炼饵服之，轻身神仙。生山谷。",
    "滑石":"味甘寒。主身热泄澼，女子乳难，癃闭。利小便，荡胃中积聚寒热，益精气。久服，轻身，耐饥，长年。生山谷。",
    "石胆":"味酸寒。主明目，目痛，金创，诸癎痉，女子阴蚀，痛，石淋，寒热，崩中下血，诸邪毒气，令人有子。炼饵服之，不老，久服，增寿神仙。能化铁为铜，成金银（《御览》引作合成）。一名毕石，生山谷。",
    "空青":"味甘寒。主眚盲，耳聋。明目，利九窍，通血脉，养精神。久服，轻身延年不老。能化铜铁铅锡作金。生山谷。",
    "曾青":"味酸小寒。主目痛止泪，出风痹，利关节，通九窍，破症坚积聚。久服轻身不老。能化金铜，生山谷。",
    "禹余粮":"味甘寒。主咳逆寒热，烦满下（《御览》有痢字），赤白，血闭，症瘕，大热。炼饵服之，不饥，轻身延年。生池泽及山岛中。",
    "太乙余粮":"味甘平。主咳逆上气，症瘕，血闭，漏下，余邪气。久服耐寒署，不饥，轻身，飞行千里，神仙（《御览》引作若神仙）。一名石脑，生山谷。",
    "白石英":"味甘，微温。主消渴，阴痿，不足，咳逆（《御览》引作呕），胸鬲间久寒，益气，除风湿痹（《御览》引作阴淫痹）。久服，轻身（《御览》引作身轻健），长年。生山谷。",
    "紫石英":"味甘温。主心腹咳逆（《御览》引作呕逆），邪气，补不足，女子风寒在子宫，绝孕，十年无子。久服，温中，轻身延年。生山谷。",
    "青石、赤石、黄石、白石、黑石脂等":"味甘平。主黄疸，泄利，肠癖，脓血，阴蚀，下血，赤白，邪气，痈肿，疽痔，恶创，头疡，疥搔。久服，补髓益气，肥健，不饥，轻身延年。五石脂，各随五色补五脏。生山谷中。",
    "白青":"味甘平。主明目，利九窍，耳聋，心下邪气，令人吐，杀诸毒，三虫。久服通神明，轻身，延年不老。生山谷。",
    "扁青":"味甘平。主目痛，明目，折跌，痈肿，金创不疗，破积聚，解毒气（《御览》引作辟毒），利精神。久服，轻身不老。生山谷。",
    "菖蒲":"味辛温。主风寒湿痹，咳逆上气，开心孔，补五脏，通九窍，明耳目，出声音。久服轻身，不忘不迷或延年。一名昌阳（《御览》引云，生石上，一寸九节者，久服轻身云云，《大观本》，无生石上三字，有云一寸九节者良，作黑字），生池泽。",
    "鞠华":"味苦平。主风，头眩肿痛，目欲脱，泪出，皮肤死肌，恶风湿痹。久服，利血气，轻身，耐老延年。一名节华，生川泽及田野。",
    "人参":"味甘微寒。主补五脏，安精神，定魂魄，止惊悸，除邪气，明目，开心益智。久服，轻身延年。一名人衔，一名鬼盖。生山谷。",
    "天门冬":"味苦平。主诸暴风湿偏痹，强骨髓，杀三虫，去伏尸。久服轻身，益气延年。一名颠勒（《尔雅》注引云，门冬一名满冬，今无文）。生山谷。",
    "甘草":"味甘平。主五脏六府寒热邪气，坚筋骨，长肌肉，倍力，金创，解毒。久服轻身延年（《御览》引云一名美草，一名密甘，《大观本》，作黑字）。生川谷。",
    "干地黄":"味甘寒。主折跌绝筋，伤中，逐血痹，填骨髓，长肌肉，作汤，除寒热积聚，除痹，生者尤良。久服，轻身不老。一名地髓，生川泽。",
    "术":"味苦温。主风寒湿痹死肌，痉疸，止汗，除热，消食，作煎饵。久服，轻身延年，不饥。一名山蓟（艺文类聚引作山筋），生山谷。",
    "菟丝子":"味辛平。主续绝伤，补不足，益气力，肥健，汁，去面皯。久服明目，轻身延年。一名菟芦，生川泽。",
    "牛膝":"味苦酸（《御览》作辛）。主寒（《御览》作伤寒），湿痿痹，四肢拘挛，膝痛不可屈伸，逐血气伤，热，火烂，堕胎。久服轻身耐老（《御览》作能老）。一名百倍，生川谷。",
    "充蔚子":"味辛微温。主明目益精，除水气。久服轻身，茎生瘾疹痒，可作浴汤。一名益母，一名益明，一名大札。生池泽。",
    "女萎":"味甘平。主中风暴热，不能动摇，跌筋结肉，诸不足。久服，去面黑皯，好颜色，润泽，轻身不老。生山谷。",
    "防葵":"味辛寒。主疝瘕，肠泄，膀胱热结，溺不下，咳逆，温疟，癫，痫，惊邪，狂走。久服，坚骨髓，益气轻身。一名梨盖。生川谷。",
    "柴胡":"味苦平。主心腹，去肠胃中结气，饮食积聚，寒热邪气，推陈致新。久服，轻身明目益精。一名地熏。",
    "麦门冬":"味甘平。主心腹，结气伤中伤饱，胃络脉绝，羸瘦短气。久服轻身，不老不饥。生川谷及堤阪。",
    "独活":"味苦平。主风寒所击，金疮止痛，贲豚，痫痓，女子疝瘕。久服，轻身耐老。一名羌活，一名羌青，一名护羌使者。生川谷。",
    "车前子":"味甘寒无毒。主气癃，止痛，利水道小便，除湿痹。久服轻身耐老。一名当道（《御览》有云一名牛舌，《大观本》作牛遗，黑字），生平泽。",
    "木香":"味辛。主邪气，辟毒疫温鬼，强志，主淋露（《御览》引云，主气不足，《大观本》，作黑字）。久服，不梦寤魇寐（《御览》引云，一名密青，又云轻身，致神仙，《大观本》，俱作黑字）。生山谷。",
    "薯蓣":"味甘温。主伤中，补虚羸，除寒热邪气，补中益气力，长肌肉。久服耳目聪明，轻身不饥，延年。一名山芋，生山谷。",
    "薏苡仁":"味甘微寒。主筋急，拘挛不可屈伸，风湿痹，下气。久服轻身益气。其根下三虫，一名解蠡。生平泽及田野。",
    "泽泻":"味甘寒。主风寒湿痹，乳难消水，养五脏，益气力，肥健。久服耳目聪明，不饥，延年轻身，面生光，能行水上。一名水泻，一名芒芋，一名鹄泻。生池泽。",
    "远志":"味苦温。主咳逆，伤中，补不足，除邪气，利九窍，益智慧，耳目聪明，不忘，强志倍力。久服，轻身不老。叶名小草，一名棘菀（陆德明《尔雅》音义引作苋），一名棘绕（《御览》作要绕），一名细草。生川谷。",
    "龙胆":"味苦涩。主骨间寒热，惊痫，邪气续绝伤，定五脏，杀盅毒。久服，益智，不忘，轻身，耐老。一名陵游，生山谷。",
    "细辛":"味辛温。主咳逆，头痛，脑动，百节拘挛，风湿，痹痛，死肌。久服明目，利九窍，轻身长年。一名小辛，生山谷。",
    "石斛":"味甘平。主伤中，除痹，下气，补五脏虚劳，羸瘦，强阴。久服厚肠胃，轻身延年。一名林兰（《御览》引云，一名禁生，观本，作黑字），生山谷。",
    "巴戟天":"味辛微温。主大风邪气，阴痿不起，强筋骨，安五脏，补中，增志，益气。生山谷。",
    "白英":"味甘寒。主寒热，八疽，消渴，补中益气。久服，轻身延年。一名谷菜（元本误作黑字），生山谷。",
    "白蒿":"味甘平。主五脏邪气，风寒温痹，补中益气，长毛发，令黑，疗心悬，少食，常饥。久服，轻身，耳目聪明，不老。生川泽。",
    "赤箭":"味辛温。主杀鬼，精物蛊毒恶气。久服益气力，长阴，肥健，轻身，增年。一名离母，一名鬼督邮。生川谷。",
    "奄闾子":"味苦微寒。主五脏淤血，腹中水气，胪张留热，风寒湿痹，身体诸痛。久服，轻身延年不老。生川谷。",
    "析蓂子":"味辛微湿。主明目，目痛泪出，除痹，补五脏，益精光。久服，轻易不老。一名蔑析，一名大蕺，一名马辛。生川泽及道旁。",
    "蓍实":"味苦平。主益气，充肌肤，明目，聪慧先知。久服，不饥不老，轻身。生山谷。",
    "六芝（赤芝、黑芝、青芝、白芝、黄芝、紫芝）":"赤芝，味苦平。主胸中结，益心气，补中，增慧智，不忘。久食，轻身不老，延年神仙。一名丹芝。黑芝，味咸平。主癃，利水道，益肾气，通九窍，聪察。久食，轻身不老，延年神仙。一名元芝。青芝，味酸平。主明目，补肝气，安精魂，仁恕，久食，轻身不老延年神仙。一名龙芝。白芝，味辛平。主咳逆上气，益肺气，通利口鼻，强志意，勇悍，安魄。久食，轻身不老延年神仙。一名玉芝。黄芝，味甘平。主心腹五邪，益脾气，安神，忠信和乐。久食，轻身不老延年神仙。一名金芝。紫芝，味甘温。主耳聋，利关节，保神，益精气，坚筋骨，好颜色。久服，轻身不老延年。一名木芝。生山谷（旧作六种，今并）。",
    "卷柏":"味辛温。生山谷。主五脏邪气，女子阴中寒热，痛，症瘕，血闭，绝子。久服轻身，和颜色。一名万岁。生山谷石间。",
    "蓝实":"味苦寒。主解诸毒，杀蛊蚑，注鬼，螫毒。久服，头不白，轻身。生平泽。",
    "芎口":"味辛温。主中风入脑，头痛，寒痹，筋挛，缓急，金创，妇人血闭，无子。生川谷。",
    "蘼芜":"味辛温。主咳逆，定惊气，辟邪恶，除蛊毒鬼注，去三虫，久服通神。一名薇芜。生川泽。",
    "最后":"神农本草经                                                        haha"
]


//寒:0,小寒:1,微寒:2,平:3,微温: 4,小温:5,温:6
//寒:115,151,171(苍黑),小寒:161,175,201(蓝灰色),微寒:194,204,208(花白),平:224,238,232(鸭卵青),微温:255,179,167(桃红),小温:239,122,130(嫣红),温:203,58,86(茜色)
let herbState = [
    "丹沙":1,
    "云母":3,
    "玉泉":3,
    "石钟乳":6,
    "涅石":0,
    "消石":0,
    "朴消":0,
    "滑石":0,
    "石胆":0,
    "空青":0,
    "曾青":1,
    "禹余粮":0,
    "太乙余粮":3,
    "白石英":4,
    "紫石英":6,
    "青石、赤石、黄石、白石、黑石脂等":3,
    "白青":3,
    "扁青":3,
    "菖蒲":6,
    "鞠华":3,
    "人参":2,
    "天门冬":3,
    "甘草":3,
    "干地黄":0,
    "术":6,
    "菟丝子":3,
    
]

let herbTranslate = [
    


]

let herbQuoteData = [
    "丹沙":"吴普》本草曰：丹沙，神农甘、黄帝苦，有毒。扁鹊苦，李氏大寒，或生武陵，采无时，能化未成水银，畏磁石，恶咸水（太平《御览》）。《名医》曰：作末，名真朱，光色如云母，可折者良，生符陵山谷，采无时。案《说文》云：丹，巴越之赤石也，象采丹井、象丹形，古文作日，亦作彤、沙、水散石也。澒，丹沙所化为水银也。管子地数篇云：山上有丹沙者，其下有金，《淮南子》地形训云：赤夭七百岁生赤丹，赤丹七百岁生赤澒。高诱云：赤丹，丹沙也。《山海经》云：丹粟，粟、沙，音之缓急也，沙，旧作砂非，汞，即澒省文。《列仙传》云：赤斧能作水澒，炼丹，与消石服之，按金石之药。古人云久服轻身延年者谓当避谷，绝人道，或服数十年乃效耳。今人和肉食服之，遂多相反，转以成疾，不可疑古书之虚证。",
    "云母":"《名医》曰：生太山，齐卢山，及琅邪，北定山石间，二月采（此录《名医》说者，即是仲景元化，及普所说，但后人合之，无从别耳，亦以补普书不备也）。案《列仙传》云：方回，炼食云母。《抱朴子·仙药》云：云母有五种，五色并具，而多青者，名云英，宜以春服之。五色并具，而多赤者，名云珠。宜以夏服之。五色并具，而多白者，名云液，宜以秋服之。五色并具，而多黑者，名云母，宜以冬服之。但有青黄二色者，名云沙，宜以季夏服之。晶晶纯白名磷石，可以四时长服之也。李善文选注：引异物志，云母一名云精，人地万岁不朽，《说文》无磷字。玉篇云：磷薄也，云母之别名。",
    "玉泉":"《吴普》曰：玉泉，一名玉屑，神农岐伯雷公，甘；李氏，平。畏冬华，恶青竹（《御览》），白玉朼如白头公（同上，事类赋引云，白玉体如白首翁）。案《周礼》玉府：王斋，供食玉。郑云：玉是阳精之纯者，食之以御水气。郑司农云：王斋，当食玉屑。《抱朴子·仙药》云：玉可以乌米酒，及地榆酒，化之为水，亦可以葱浆，消之为炲，亦可饵以为丸，亦可烧以为粉，服之，一年以上，入水不沾，入火不灼，刃之不伤，百毒不犯也。不可用已成之器，伤人无益，当得璞玉，乃可用也，得于阗国白玉尤善，其次有南阳徐善亭部界界中玉，及日南，卢容水中玉，亦佳。",
    "石钟乳":"《吴普》曰：钟乳，一名虚中，神农辛，桐君黄帝医和甘，扁鹊甘无毒（《御览》引云李氏，大寒）。生山谷（《御览》引云，太山山谷）。阴处岸下，溜汁成（《御览》引作溜汁所成聚），如乳汁，黄白色，空中相通。二月三月采，阴干（凡《吴普》本草，掌禹锡所引者不复注，惟注其出《御览》诸书者）。《名医》曰：一名公乳，一名芦石，一名夏石，生少室及太山，采无时。案《范子计然》云：石钟乳出武都，黄白者善（凡引计然，多出事文类聚，文选注，《御览》，及《大观本草》）。《列仙传》云：卬疏，煮石髓而服之，谓之石钟乳，钟当为潼，《说文》云乳汁也，钟假音字。",
    "涅石":"《吴普》曰：矾石一名羽涅，一名羽泽，神农岐伯酸，扁鹊咸，雷公酸，无毒，生河西，或陇西，或武都，石门。采无时，岐伯，久服伤人骨（《御览》）。《名医》曰：一名羽泽，生河西，及陇西，武都，石门，采无时。案《说文》无矾字，玉篇云：矾石也，涅，矾石也、《西山经》云：女床之山，其阴多涅石。郭璞云即矾石也，楚人名为涅石，秦名为羽涅也，《本草经》，亦名曰涅石也，《范子计然》云：矾石出武都。《淮南子》俶真训云：以涅染缁。高诱云：涅，矾石也，旧，涅石作矾石，羽涅作羽涅非。",
    "消石":"《吴普》曰：消石，神农苦，扁鹊甘（凡出掌禹锡所引，亦见《御览》者，不箸所出）。《名医》曰：一名芒硝，生益州，及五都，陇西，西羌，采无时。案《范子计然》云：硝石出陇道，据《名医》，一名芒硝，又别出芒消条，非；北山经云：京山，其阴处有元（石肃），疑（石肃），即硝异文。",
    "朴消":"吴普》曰：朴硝石，神农岐伯雷公无毒，生益州，或山阴，入土，千岁不变，炼之不成，不可服（《御览》）。《名医》曰：一名消石朴，生益州，有盐水之阳，采无时。案《说文》云：朴，木皮也，此盖消石外裹如玉璞耳，旧作硝，俗字。",
    "滑石":"《名医》曰：一名液石，一名共石，一名脱石，一名番石，生赭阳，及太山之阴，或掖北，白山，或卷山，采无时。案《范子计然》云：滑石，白滑者善；南越志云：膋城县出膋石，即滑石也。",
    "石胆":"《吴普》曰：石胆神农酸，小寒；李氏，大寒；桐君辛有毒；扁鹊苦无毒（《御览》引云，一名黑石，一名铜勒，生羌道或句青山，二月庾子辛丑采）。《名医》曰：一名黑石，一名碁石，一名铜勒，生羌道，羌里，句青山，二月庚子辛丑日采。案《范子计然》云：石胆出陇西羌道；陶宏景云：仙经一名立制石，《周礼》疡医，凡疗疡以五毒攻之；郑云：今医方有五毒之药，作之合黄，置石胆丹沙，雄黄，矾石，慈石，其中，烧之三日三夜，其烟上著，以鸡羽扫取之，以注创，恶肉破骨则尽出；图经曰：故翰林学士杨亿尝笔记直史馆杨嵎，有疡生于颊，人语之，依郑法合烧，药成。注之疮中，遂愈。信古方攻病之速也。",
    "空青":"《吴普》曰：空青，神农甘，一经酸，久服，有神仙玉女来时，使人志高（《御览》）。《名医》曰：生益州及越巂山有铜处，铜精熏则生空青，其腹中空，三月中旬，采，亦无时。案《西山经》云：皇人之山，其下多青；郭璞云：空青曾青之属；《范子计然》云：空青出巴郡；《司马相如赋》云：丹青，张揖云青，青也；颜师古云：青，今之丹青也。",
    "曾青":"《名医》曰：生蜀中及越巂，采无时。案管子揆度篇云：秦明山之曾青；《荀子》云：南海则有曾青，杨倞注，曾青，铜之精；《范子计然》云：曾青山宏农豫章，白青出新涂，青色者善；《淮南子》地形训云：青天八百岁生青曾；高诱云：青曾，青石也。",
    "禹余粮":"《名医》曰：一名白余粮，生东海及池泽中。案《范子计然》云：禹余粮出河东；《列仙传》云：赤斧，上华山取禹余粮；《博物志》云：世传昔禹治水，弃其所余食于江中，而为药也，按此出神农经，则禹非夏禹之禹，或本名白余粮，《名医》等移其名耳。",
    "太乙余粮":"《吴普》曰：太一禹余粮，一名禹哀，神农岐伯雷公甘平，李氏小寒，扁鹊甘无毒，生太山上，有甲，甲中有白，白中有黄，如鸡子黄色，九月采，或无时。《名医》曰：生太白，九月采。案《抱朴子》金丹篇云：灵丹经，用丹沙，雄黄，雌黄，石硫黄，曾青，矾石，磁石，戎盐，太一禹余粮，亦用六一泥，及神室祭醮，合之，三十六日成。",
    "白石英":"《吴普》曰：白石英，神农甘，岐伯黄帝雷公扁鹊无毒，生太山，形如紫石英，白泽，长者二三寸，采无时（《御览》引云，久服，通日月光）。《名医》曰：生华阴及太山。案《司马相如赋》，有白附，苏林云白附，白石英也，司马山云，出鲁阳山。",
    "紫石英":"《吴普》曰：紫石英，神农扁鹊味甘平，李氏大寒，雷公大温，岐伯甘无毒，生太山，或会稽，采无时，欲令如削，紫色达头如樗蒲者。又曰青石英，形如白石英，青端赤后者是，赤石英形如白石英，赤端白后者是，赤泽有光，味苦，补心气；黄石英形如白石英，黄色如金，赤端者是；黑石英，形如白石英，黑泽有光（《御览》掌禹锡引此节文）。《名医》曰：生太山，采无时。",
    "青石、赤石、黄石、白石、黑石脂等":"《吴普》曰：五色石脂，一名青、赤、黄、白、黑符。青符神农甘，雷公酸无毒，桐君辛无毒，李氏小寒，生南山，或海涯，采无时。赤符，神农雷公甘，黄帝扁鹊无毒，李氏小寒，或生少室，或生太山，色绛，滑如脂。黄符，李氏小寒，雷公苦，或生嵩山，色如钝脑，雁雏，采无时。白符，一名随髓，岐伯雷公酸无毒，李氏小寒，桐君甘无毒，扁鹊辛，或生少室天娄山，或太山。黑符，一名石泥，桐君甘无毒，生洛西山空地。《名医》曰：生南山之阳，一本作南阳，又云黑石脂，一名石涅，一名石墨。案《吴普》引神农甘云云：五石脂各有条，后世合为一条也；《范子计然》云：赤石脂出河东，色赤者善，《列仙传》云，赤须子好食石脂。",
    "白青":"《吴普》日：神农甘平，雷公酸无毒，生豫章，可消而为铜（《御览》）。《名医》曰：生豫章，采无时。案《范子计然》云：白青，出巴郡。",
    "扁青":"《吴普》曰：扁青，神农雷公小寒无毒，生蜀郡，治丈夫内绝，令人有子（《御览》引云，治痈脾风痹，久服轻身）。《名医》曰：生朱崖武都朱提，采无时。案《范子计然》云：扁青出宏农豫章。上，玉、石，上品一十八种，旧同。",
    "菖蒲":"《吴普》曰：菖蒲一名尧韭（艺文类聚引云，一名昌阳）。《名医》曰：生上洛，及蜀郡严道，五月十二日采根，阴干。案《说文》云：（上艹下左工右阝），菖蒲也，益州生，□□□也，《广雅》云，邛昌阳，菖蒲也，《周礼》醢人云，菖本，郑云菖本，菖蒲根，切之四寸为菹，春秋左《传》云，食以菖歜；杜预云：菖歜，菖蒲菹；吕氏春秋云：冬至后五旬七日，菖始生，菖者百草之先，于是始耕；《淮南子》说山训云：菖羊去蚤虱而来蛉穷；高诱云：菖羊，菖蒲；《列仙传》云：商邱子胥食菖蒲根，务光服蒲韭根，《离骚》草木疏云，沈存中云：所谓兰荪，即今菖蒲是也。",
    "鞠华":"《吴普》曰：菊华一名白华（初学记），一名女华，一名女茎。《名医》曰：一名日精，一名女节，一名女华，一名女茎，一名更生，一名周盈，一名傅延年，一名阴成，生雍州。正月采根，三月采叶，五月采茎，九月采花，十一月采实，皆阴干。案《说文》云：蘜治墙也，蘜日精也，似秋华，或省作，《尔雅》云，蘜治墙；郭璞云：今之秋华菊，则蘜、（上艹下左辛右匊）、蓻皆秋华，字、惟今作菊，《说文》以为大菊瞿麦，假音用之也。",
    "人参":"《吴普》曰：人参一名土精，一名神草，一名黄参，一名血参，一名人微，一名玉精，神农甘小寒，桐君雷公苦，岐伯黄帝甘无毒，扁鹊有毒，生邯郸，三月生叶，小兑，核黑，茎有毛，三月九月采根，根有头足手面目如人（《御览》）。《名医》曰：一名神草，一名人微，一名土精，一名血参，如人形者有神，生上党及辽东，二月四月八月上旬采根，竹刀刮，暴干，无令见风。案《说文》云：参，人参，药草，出上党；《广雅》云：地精，人参也；《范子计然》云：人参出上党，状类人者善。刘敬叔异苑云：人参一名土精，生上党者佳，人形皆具，能作儿啼。",
    "天门冬":"《名医》曰：生奉高山，二月七月八月采根，暴干。案《说文》云墙，墙蘼，满冬也；《中山经》云：条谷之山，其草多宜冬；《尔雅》云：墙蘼，满冬；《列仙传》云：赤须子食天门冬；《抱朴子·仙药》云：天门冬，或名地门冬，或名筵门冬，或名颠棘，或名淫羊食，或名管松。",
    "甘草":"《名医》曰：一名密甘，一名美草，一名密草，一名蕗（当作蘦）草，生河西积沙山，及上郡，二月八日除日，采根暴干，十日成。案《说文》云：苷，甘草也，蘦，大苦也，苦，大苦苓也；《广雅》云：美草，甘草也，《毛诗》云隰有苓，《传》云，苓，大苦；《尔雅》云：蘦，大苦；郭璞云：今甘草，蔓延生，叶似荷，青黄，茎赤黄，有节，节有枝相当，或云蘦似地黄，此作甘，省字，蘦，苓通。",
    "干地黄":"《名医》曰：一名苄，一名芑，生咸阳，黄土地者佳，二月八日采根阴干。案《说文》云：苄，地黄也，礼曰钘毛牛藿，羊苄，豕徽；《广雅》云：地髓，地黄也；《尔雅》云：苄，地黄；郭璞云：一名地髓，江东呼苄；《列仙传》云：吕尚服地髓。",
    "术":"《吴普》曰：术，一名山连，一名山芥，一名天苏，一名山姜（艺文类聚）。《名医》曰：一名山姜，一名山连，生郑山，汉中，南郑，二月三月八月九月，采根暴干。案《说文》云：术，山蓟也；《广雅》云：山姜，术也，白术，牡丹也；《中山经》云：首山草多术；郭璞云：术，山蓟也；《尔雅》云：术，山蓟；郭璞云：今术似蓟，而生山中；《范子计然》云：术出三辅，黄白色者善；《列仙传》云：涓子好饵术；《抱朴子·仙药》云：术一名山蓟，一名山精，故神药经曰：必欲长生，长服山精。",
    "菟丝子":"《吴普》曰：菟丝，一名玉女，一名松萝，一名鸟萝，一名鸭萝，一名复实，一名赤网，生山谷（《御览》）。《名医》曰：一名菟缕，一名唐蒙，一名玉女，一名赤网，一名菟累，生朝鲜田野，蔓延草木之上，色黄而细为赤网，色浅而大为菟累，九月，采实暴干。案《说文》云：蒙，玉女也；《广雅》云：菟邱，菟丝也，女萝，松萝也；《尔雅》云：唐蒙，女萝，女萝，菟丝，又云蒙，玉女；《毛诗》云：爱采唐矣，《传》云唐蒙，菜名，又茑与女萝，《传》云，女萝，菟丝松萝也；陆玑云：今菟丝蔓连草上生，黄赤如金，今合药，菟丝子是也，非松萝，松萝自蔓松上，枝正青，与菟丝异；《楚词》云：被薛荔兮带女萝；王逸云：女萝，菟丝也；《淮南子》云：千秋之松，下有茯苓，上有菟丝，高诱注云，茯苓，千岁松脂也，菟丝生其上，而无根，旧作菟，非。",
    "牛膝":"《吴普》曰：牛膝，神农甘，一经酸，黄帝扁鹊甘，李氏温，雷公酸无毒，生河内，或临邛，叶如夏蓝，茎，本赤，二月八月采（《御览》）。《名医》曰：生河内及临朐，二月八月十月，采根，阴干。案《广雅》云：牛茎牛膝也；陶宏景云：其茎有节似膝，故以为名也，膝当为膝。",
    "充蔚子":"《名医》曰：一名贞蔚，生海滨，五月采。案《说文》云：蓷，萑也，《广雅》云：益母，充蔚也，《尔雅》云：萑，蓷；郭璞云：今茺蔚也；《毛诗》云：中谷有蓷，《传》云，蓷；鵻也；陆玑云：旧说及魏博士济阴周元明，皆云庵闾，是也，韩诗及三苍说，悉云益母，故曾子见益母而感；刘歆曰蓷，臭秽，臭秽即茺蔚也，旧作茺，非。",
    "女萎":"《吴普》曰：女萎一名葳蕤，一名玉马，一名地节，一名虫蝉，一名乌萎，一名荧，一名玉竹，神农苦，一经甘，桐君雷公扁鹊甘无毒，黄帝辛，生太山山谷，叶青黄相值如姜，二月七月采，治中风暴热，久服轻身（《御览》），一名左眄，久服轻身耐老（同上）。《名医》曰：一名荧，一名地节，一名玉竹，一名马熏，生太山及邱陵，立春后采，阴干。案《尔雅》云：荧委萎；郭璞云：药草也，叶似竹，大者如箭，竿，有节，叶狭而长，表白裹青，根大如指，长一二尺，可啖；陶宏景云：按本经有女萎，无萎蕤，别录有萎蕤，而为用正同，疑女萎即萎蕤也，惟名异耳；陈藏器云：魏志樊阿传，青粘，一名黄芝，一名地节，此即萎蕤。",
    "防葵":"《吴普》曰：房葵一名梨盖，一名爵离，一名房苑，一名晨草，一名利如，一名方盖，神农辛，小寒，桐君扁鹊无毒，岐伯雷公黄帝苦，无毒，茎叶如葵，上黑黄，二月生根，根大如桔梗，根中红白，六月花白，七月八月实白，三月三日采根（《御览》）。《名医》曰：一名房慈，一名爵离，一名农果，一名利茹，一名方盖，生临淄，及嵩高太山少室，三月三日，采根暴干。案《博物志》云：防葵与狼毒相似。",
    "柴胡":"《吴普》曰：茈葫，一名山菜，一名茹草，神农岐伯雷公苦无毒，生冤句，二月八月采根（《御览》）。《名医》曰：一名山菜，一名茹草，叶一名芸蒿，辛香可食，生宏农及冤句，二月八月采根暴干。案《博物志》云：芸蒿叶似邪蒿，春秋有白蒻，长四五寸，香美可食，长安及河内并有之；《夏小正》云：正月采芸，月令云仲春芸始生；吕氏春秋云：菜之美者，华阳之芸，皆即此也，急就篇有芸；颜师古注云：即今芸蒿也，然则是此茈胡叶矣，茈柴前声相转，《名医》别录，前胡条，非；陶宏景云：本经上品，有茈胡而无此，晚来医乃用之。",
    "麦门冬":"《吴普》曰：一名马韭，一名衅冬，一名忍冬，一名忍陵，一名不死药，一名仆垒，一名随脂（太平《御览》引云，一名羊韭，秦，一名马韭，一名禹韭，韭，越一名羊齐，一名麦韭，一名禹韭，一名衅韭，一名禹余粮），神农岐伯甘平，黄帝桐君雷公甘无毒，李氏甘小温，扁鹊无毒，生山谷肥地，叶如韭，肥泽丛生，采无时，实青黄。《名医》曰：秦名羊韭，齐名麦韭，楚名马韭，越名羊蓍，一名禹葭，一名禹余粮，叶如韭，冬夏长生，生函谷肥土，石间久废处，二月三月八月十月采，阴干。案《说文》云：荵，荵冬草；《中山经》云：青要之山，是多仆累，据《吴普》说，即麦门冬也，忍，荵，垒，累，音同；陶宏景云：实如青珠，根似穬麦，故谓麦门冬。",
    "独活":"《吴普》曰：独活一名胡王使者，神农黄帝苦无毒，八月采，此药有风花不动，无风独摇（《御览》）。《名医》曰：一名胡王使者，一名独摇草，此草得风不摇，无风自动，生雍州，或陇西南安，二月八月采根暴干。案《列仙传》云：山图服羌活独活，则似二名，护羌胡王皆羌字缓声，犹专诸为专设诸，庚公差为瘐公之斯，非有义也。",
    "车前子":"《名医》曰：一名芣苢，一名虾蟆衣，一名牛遗，一名胜舄，生真定邱陵阪道中，五月五日采，阴干。案《说文》云：芣一曰芣苢，苢，芣苢，一名马舄，其实如李，令人宜子，周书所说，《广雅》云当道马舄也；《尔雅》云：舄莒马，舄，马舄车前；郭璞云：今车前草，大叶长穗，好生道边，江东呼为虾蟆衣，又藬，牛蘈；孙炎云：车前一名牛蘈，《毛诗》云采采芣苢，《传》云芣苢，马舄，马舄，车前也；陆玑云：马舄一名车前，一名当道，喜在牛迹中生，故曰车前当道也，今药中车前子，是也，幽州人谓之牛舌草。",
    "木香":"《名医》曰：一名蜜香，生永昌。",
    "薯蓣":"《吴普》曰：薯蓣，一名诸署（《御览》作署豫，作诸署，艺文类聚，亦作诸），齐越名山芋，一名修脆，一名儿草（《御览》引云，秦楚名玉延，齐越名山芋，郑赵名山芋，一名玉延）神农甘小温，桐君雷公甘（御引作苦），无毒，或生临朐钟山，始生，赤茎细蔓，五月华白，七月实青黄，八月熟落，根中白，皮黄，类芋（《御览》引云，二月八月采根，恶甘遂）。《名医》曰：秦楚名玉延，郑越名土诸，生嵩高，二月八月采根，暴干。案《广雅》云：玉延，薯豫，署蓣也；北山经云：景山草多薯豫；郭璞云：根似羊蹄可食，今江南单呼为薯，语有轻重耳；《范子计然》云：薯豫本出三辅，白色者善；本章衍义云：山药上一字犯宋英庙讳，下一字曰蓣，唐代宗名豫，故改下一字为药。",
    "薏苡仁":"《名医》曰：一名屋菼，一名起实，一名赣，生真定，八月采实，采根无时。案《说文》云：薏,薏苢，一曰英，赣，一曰薏苢；《广雅》云：赣，起实，目也，吴越春秋，鲧娶于有莘氏之女，名曰女嬉，年壮未孳，嬉于砥山，得薏苡而吞之，意若为人所感，因而妊孕，后汉书马援传，援在交趾，常饵薏苡实，用能轻身省欲以胜瘴，薏，俗作薏，非。",
    "泽泻":"《名医》曰：生汝南，五六八月采根，阴干。案《说文》云：水写也；《尔雅》云：蕍舄；郭璞云：今泽舄，又，牛肤；郭璞云，《毛诗》《传》云：水舄也，如续断，寸寸有节，拔之可复《毛诗》云，言采其藚，《传》云，藚，水舄也；陆玑云：今泽舄也，其叶如车前草大，其味亦相似，徐州广陵人食之。",
    "远志":"《名医》曰：生太山及冤句，四月采根叶，阴干。案《说文》云：蒬，棘蒬也；《广雅》云：蕀苑，远志也，其上谓之小草；《尔雅》云：绕，蕀蒬；郭璞云：今远志也，似麻黄，赤华，叶锐而黄。",
    "龙胆":"《名医》曰：生齐朐及冤句，二月八月十一月十二月，采根，阴干。",
    "细辛":"《吴普》曰：细辛一名细草（《御览》引云，一名小辛），神农黄帝雷公桐君辛小温，岐伯元毒，李氏小寒，如葵叶，色赤黑，一根一叶相连（《御览》引云，三月八月采根）。《名医》曰：生华阴，二月八月采根，阴干。案《广雅》云：细条，少辛，细辛也；《中山经》云：浮戏之山，上多少辛；郭璞云：细辛也；《管子·地员篇》云：小辛大蒙；《范子计然》云：细辛出华阴，色白者善。",
    "石斛":"《吴普》曰：石斛，神农甘平，扁鹊酸，李氏寒（《御览》）。《名医》曰：一名禁生，一名杜兰，一名石蓫，生六安水傍石上，七月八月，采茎，阴干。案《范子计然》云：石斛，出六安。",
    "巴戟天":"《名医》曰：生巴郡及下邳，二月八月，采根，阴干。",
    "白英":"《名医》曰：一名白草，生益州，春采叶，夏采茎，秋采花，冬采根。案《尔雅》云：苻，鬼目；郭璞云：今江东有鬼目草茎似葛，叶圆而毛，子如耳珰也，赤色丛生，《唐本》注；白英云，此鬼目草也。",
    "白蒿":"《名医》曰：生中山，二月采。案《说文》云：蘩，白蒿也，艾，冰台也；《广雅》云：蘩，母，蒡葧也；《尔雅》云：艾，冰台；郭璞云：今艾，白蒿；《夏小正》云：二月采蘩；《传》云：蘩，由胡，由胡者，繁母也，繁母者，旁勃也；《尔雅》云：蘩，皤蒿；郭璞云：白蒿，又蘩，由胡；郭璞云：未详；《毛诗》云：于以采蘩，《传》云蘩，皤蒿也，又采蘩祁祁；《传》云：蘩，白蒿也；陆玑云：凡艾，白色者为皤蒿；《楚词》王逸注云：艾，白蒿也，按皤白，音义皆相近，艾，是药名，《本草经》无者，即白蒿是也，《名医》别出艾条，非。",
    "赤箭":"吴普》曰：鬼督邮，一名神草，一名阎狗，或生太山，或少室，茎箭赤无叶，根如芋子，三月四月八月，采根，日干，治痈肿（《御览》）。《名医》曰：生陈仓雍州，及太山少室，三月四月八月采根，暴干。案《抱朴子》云：按仙方中，有合离草，一名独摇，一名离母，所以谓之合离，离母者，此草为物，下根如芋魁，有游子十二枚，周环之，去大魁数尺，虽相须，而实不相连，但以气相属耳，别说云，今医家见用天麻，即是此赤箭根。",
    "奄闾子":"《吴普》曰：奄闾，神农雷公桐君岐伯苦小温无毒，李氏温，或生上党，叶青厚两相当，七月花曰，九月实黑，七月九月十月采，驴马食仙去（《御览》）。《名医》曰：駏驉食之神仙，生雍州，亦生上党，及道边，十月采实，阴干。案《司马相如赋》，有奄闾，张揖云奄闾，蒿也，子可治疾。",
    "析蓂子":"《吴普》曰：析蓂一名析目，一名荣冥，一名马骍，雷公神农扁鹊辛，李氏小温，四月采干，二十日生道旁，得细辛良，畏干姜，苦参荠实，神农无毒，生野田，五月五日采阴干，治腹胀（《御览》）。《名医》曰：一名大荠，生咸阳，四月五月采，暴干。案《说文》云：蓂，析蓂，大荠也；《广雅》云：析蓂，马辛也；《尔雅》云：析蓂大荠；郭璞云：荠叶细，俗呼之曰老荠，旧作菥，非。",
    "蓍实":"《吴普》曰：蓍实味苦酸平无毒，主益气，充肌肤，明目聪慧，先知，久服，不饥不老，轻身，生少室山谷，八月九月采实暴干（《御览》）。《名医》曰：生少室，八月九月采实，日干。案《说文》云：蓍，蒿属，生千岁，三百茎；《史记》龟策《传》云：蓍，百茎共一根。",
    "六芝（赤芝、黑芝、青芝、白芝、黄芝、紫芝）":"《吴普》曰：紫之一名木芝。《名医》曰：赤芝生霍山，黑芝生恒山，青芝生太山，白芝生华山，黄芝生嵩山，紫芝生高夏地上，色紫，形如桑（《御览》），六芝皆无毒，六月八月采。案《说文》云：芝，神草也；《尔雅》云：苬芝；郭璞云：芝一岁三华，瑞草；礼内则云：芝栭；卢植注云：芝，木芝也；《楚词》云：采三秀于山间；王逸云：三秀谓芝草；后汉书华陀传：有漆叶青面；注引陀传曰：青面者，一名地节，一名黄芝，主理五脏，益精气，本字书无面字，相传音女廉反；《列仙传》云：吕尚服泽芝；《抱朴子·仙药》云：赤者如珊瑚，白者如截肪，黑者如泽漆，青者如翠羽，黄者如紫金，而皆光明洞彻如坚冰也。",
    "卷柏":"《吴普》曰：卷柏，神农辛，桐君雷公甘（《御览》引云，一名豹足，一名求股，一名万岁，一名神枝，时，生山谷）。《名医》曰：一名豹足，一名求股，一名交时，生常山，五月七月采，阴干。案《范子计然》云：卷柏，出三辅。",
    "蓝实":"《名医》曰：其茎叶可以染青，生河内。案《说文》云：葴马蓝也，蓝，染青草也；《尔雅》云：葴，马蓝；郭璞云：今大叶冬蓝也，《周礼》掌染草；郑注云：染草，蓝茜，象斗之属，《夏小正》五月启灌蓝；《毛诗》云：终朝采蓝，《笺》云，蓝，染草也。",
    "芎口":"《吴普》曰：芎口（《御览》引云一名香果），神农黄帝岐伯雷公辛无毒，扁鹊酸无毒，李氏生温熟寒，或生胡无桃山阴，或太山（《御览》作或斜谷西岭，或太山），叶香细青黑，文赤如藁本，冬夏丛生，五月华赤，七月实黑，茎端两叶，三月采，根有节，似马衔状。《名医》曰：一名胡口，一名香果，其叶名蘼芜，生武功斜谷西岭，三月四月，采根暴干。案《说文》云：营，营口，香草也，芎，司马相如说或从弓；春秋左《传》云：有山鞠穷乎；杜预云：鞠穷所以御湿；《西山经》云：号山，其草多芎口；郭璞云：芎口一名江蓠；《范子计然》云：芎口生始无，祜者善（有脱字）；《司马相如赋》：有芎口；司马贞引司马彪云：芎口似藁本；郭璞云：今历阳呼为江离。",
    

]

//first digit represent 上(1) 中(2) 下(3) 品， second digit for different types
let herbQuality = [
    "丹沙":11,
    "云母":11,
    "玉泉":11,
    "石钟乳":11,
    "涅石":11,
    "消石":11,
    "朴消":11,
    "滑石":11,
    "石胆":11,
    "空青":11,
    "曾青":11,
    "禹余粮":11,
    "太乙余粮":11,
    "白石英":11,
    "紫石英":11,
    "青石、赤石、黄石、白石、黑石脂等":11,
    "白青":11,
    "扁青":11,
    "菖蒲":12,
    "鞠华":12,
    "人参":12,
    "天门冬":12,


]



class HerbData: NSObject {

}
